def area(a):
    '''
    Принимает сторону квадрата a, возвращает его площадь.

    Заданные параметры:
        a (int/float): длина стороны квадрата

    Возвращаемое значение:
        square_area (int/float): площадь квадрата
    '''
    return a * a


def perimeter(a):
    '''
    Принимает сторону квадрата a, возвращает его периметр.

    Заданные параметры:
        a (int/float): длина стороны квадрата

    Возвращаемое значение:
        square_perimeter (int/float): периметр квадрата
    '''
    return 4 * a
