def area(a, h):
    '''
    Принимает основание a и высоту h, возвращает площадь треугольника.

    Заданные параметры:
        a (int/float): основание треугольника
        h (int/float): высота треугольника

    Возвращаемое значение:
        triangle_area (int/float): площадь треугольника
    '''
    return a * h / 2


def perimeter(a, b, c):
    '''
    Принимает стороны a, b и c, возвращает периметр треугольника.

    Заданные параметры:
        a (int/float): первая сторона треугольника
        b (int/float): вторая сторона треугольника
        c (int/float): третья сторона треугольника

    Возвращаемое значение:
        triangle_perimeter (int/float): периметр треугольника
    '''
    return a + b + c
